// Напишите программу, которая перевернёт одномерный массив (последний элемент будет на первом месте, а первый - на последнем и т.д.)

int[] 
















/*
Напишите программу, которая принимает на вход три числа и проверяет, может ли существовать треугольник с сторонами такой длины.

Каждая сторона треугольника должна быть строго меньше суммы двух других.
*/



/*
Напишите программу, которая будет создавать копию заданного массива с помощью поэлементного копирования.
*/




/*
Не используя рекурсию, выведите первые N чисел Фибоначчи. Первые два числа Фибоначчи: a и b.
*/